Paullistowel/pestguard/firmware/pestguard_esp32/pestguard_esp32.ino
/*
 * PestGuard — Acoustic Pest & Rodent Deterrent Node
 * ESP32 standalone firmware (Project 43)
 *
 * One board does everything: samples a microphone, runs a Goertzel band-energy
 * detector, decides whether a pest is present, drives the ultrasonic / strobe /
 * buzzer deterrent, and serves its state to the PestGuard mobile app over Wi-Fi.
 *
 * ---------------------------------------------------------------------------
 * WHAT THIS CAN AND CANNOT HEAR — read this before wiring
 * ---------------------------------------------------------------------------
 * The ESP32's ADC, driven as fast as `adc1_get_raw()` reliably allows, samples
 * at SAMPLE_RATE_HZ (40 kHz by default). Nyquist puts a hard ceiling at half of
 * that: 20 kHz. Anything above 20 kHz is invisible to this code no matter what
 * microphone you attach.
 *
 * That means:
 *   YES — bird calls, insect stridulation, rodent gnawing and audible squeaks,
 *         machinery, wind. All of it sits under 20 kHz.
 *   NO  — true rodent ultrasonic vocalisation (20–40 kHz) and bat echolocation.
 *
 * The original proposal lists a 20–40 kHz band. It is not reachable on this
 * hardware path, and a standard electret capsule rolls off around 16–20 kHz
 * anyway, so it would read as noise even if the sample rate allowed it. Rather
 * than ship a band that is silently always empty, the four bands below span the
 * range this hardware genuinely covers. The app labels its charts from the
 * `bands` array this firmware reports, so they stay honest automatically.
 *
 * To reach true ultrasound you need both an ultrasonic transducer (e.g. a
 * 40 kHz receiver or a MEMS mic specified past 40 kHz) AND a faster acquisition
 * path — I2S with an external ADC at >=96 kHz. That is a hardware change, not a
 * firmware setting.
 *
 * ---------------------------------------------------------------------------
 * WIRING (change the pin defines below to match your board)
 * ---------------------------------------------------------------------------
 *   Microphone (MAX9814 / MAX4466 analog out) ... GPIO36  (ADC1_CH0, input only)
 *   Battery sense, via 100k/100k divider ........ GPIO35  (ADC1_CH7, input only)
 *   Ultrasonic transducer (through driver) ...... GPIO25
 *   Strobe LED array (through MOSFET gate) ...... GPIO26
 *   Piezo buzzer ................................ GPIO27
 *   Status LED .................................. GPIO2   (onboard on most devkits)
 *
 * GPIO36 and GPIO35 are input-only pins — correct for ADC, and they cannot be
 * driven by mistake. Do not move the mic to an ADC2 pin (GPIO0/2/4/12-15/25-27):
 * ADC2 is unavailable whenever Wi-Fi is active, which is always, here.
 *
 * Never drive the ultrasonic transducer or the LED array straight off a GPIO.
 * The ESP32 sources 40 mA absolute maximum per pin; use a MOSFET or a driver.
 *
 * ---------------------------------------------------------------------------
 * LIBRARIES
 * ---------------------------------------------------------------------------
 * One external library, via Arduino IDE → Tools → Manage Libraries:
 *   "WebSockets" by Markus Sattler   (arduinoWebSockets)
 * Everything else ships with the ESP32 board package.
 *
 * Board: "ESP32 Dev Module". Tested against ESP32 Arduino core 2.x and 3.x.
 */

#include <WiFi.h>
#include <WebServer.h>
#include <WebSocketsServer.h>
#include <Preferences.h>
#include <ESPmDNS.h>
#include <time.h>
#include <math.h>
#include "driver/adc.h"

// ===========================================================================
// USER SETTINGS — edit these two lines, flash, done.
// ===========================================================================
const char* WIFI_SSID     = "YOUR_WIFI_NAME";
const char* WIFI_PASSWORD = "YOUR_WIFI_PASSWORD";

// Shown in the app. Change per node if you build more than one.
const char* NODE_NAME = "North Gate";
const char* NODE_ZONE = "North Field";

// ===========================================================================
// Pins
// ===========================================================================
#define PIN_MIC          36
#define PIN_BATTERY      35
#define PIN_ULTRASONIC   25
#define PIN_STROBE       26
#define PIN_BUZZER       27
#define PIN_STATUS_LED    2

// ===========================================================================
// Signal processing
// ===========================================================================
/*
 * SENSOR TYPE — this is the most important setting in the file.
 *
 *   SENSOR_ENVELOPE (1): a sound-sensor module (KY-038, KY-037, LM393-based).
 *     Its analog pin outputs a rectified, smoothed *amplitude envelope*, not a
 *     waveform. There is no spectrum to extract — running a Goertzel over it
 *     produces numbers, but they mean nothing. In this mode the node measures
 *     what the hardware can actually report: loudness, attack sharpness, event
 *     duration and burst rhythm. Gnawing, chirping and steady ambient noise
 *     separate well on those.
 *
 *   SENSOR_WAVEFORM (0): an electret module with a real preamp (MAX9814,
 *     MAX4466). This outputs an audio waveform, so the four Goertzel bands
 *     below become meaningful and species classification by spectrum works.
 *
 * Set this to match what is physically on the ADC pin. The app reads the mode
 * from the status endpoint and labels its charts accordingly, so it never
 * claims a measurement the sensor cannot make.
 */
#define SENSOR_ENVELOPE  1

#if SENSOR_ENVELOPE
  // An LM393 envelope follower has no useful content above a few hundred Hz.
  // Sampling faster buys nothing but heat.
  #define SAMPLE_RATE_HZ   2000
  #define WINDOW_SAMPLES    256     // 128 ms of envelope per window
#else
  #define SAMPLE_RATE_HZ  40000
  #define WINDOW_SAMPLES    512     // 12.8 ms at 40 kHz
#endif

#define NUM_BANDS           4
#define PROBES_PER_BAND     3

// Band edges in Hz. Must stay below SAMPLE_RATE_HZ / 2.
const float BAND_EDGES[NUM_BANDS][2] = {
  { 1500.0f,  5000.0f },   // b1 — bird calls, rodent gnawing transients
  { 5000.0f,  9000.0f },   // b2 — rodent squeaks, upper bird harmonics
  { 9000.0f, 14000.0f },   // b3 — insect stridulation
  {14000.0f, 19000.0f },   // b4 — high insect harmonics, sibilant noise
};

