Paullistowel/pestguard/firmware/pestguard_esp32/pestguard_esp32.ino
// Battery: 100k/100k divider, so the pin sees half the pack voltage.
#define BATTERY_DIVIDER   2.0f
#define BATTERY_FULL_V    4.15f
#define BATTERY_EMPTY_V   3.20f
// Trim this if your multimeter disagrees with the reported voltage.
#define ADC_REF_V         3.30f

#define EVENT_BUFFER_SIZE  200
#define WS_PORT           81

// ===========================================================================
// State
// ===========================================================================
WebServer       http(80);
WebSocketsServer ws(WS_PORT);
Preferences     prefs;

struct Config {
  uint8_t  sens;             // 0..100, detection threshold above noise floor
  char     pattern[8];       // sweep | pulse | burst | random | silent
  uint8_t  intensity;        // 0..100 ultrasonic duty
  uint8_t  dur;              // deterrent burst length, seconds
  uint16_t cooldown;         // seconds
  bool     ultrasonic;
  bool     strobe;
  bool     buzzer;
  bool     quiet;
  uint16_t quietStart;       // minutes from midnight
  uint16_t quietEnd;
  bool     quietUltrasonic;
  uint16_t heartbeat;        // seconds
} cfg;

struct Event {
  uint32_t id;
  uint64_t ts;               // epoch ms, 0 if no NTP
  uint32_t up;               // millis at capture
  char     evt[10];
  char     cls[8];
  float    conf;
  float    b[NUM_BANDS];
  uint16_t dwell;
  uint8_t  batt;
  float    volts;
  int16_t  rssi;
  bool     chUltrasonic, chStrobe, chBuzzer;
  uint16_t durMs;
};

Event    ring[EVENT_BUFFER_SIZE];
uint16_t ringHead = 0;
uint16_t ringCount = 0;
uint32_t eventSeq = 0;

bool     armed = true;
bool     faulted = false;
char     faultMsg[64] = "";

// Detector state
float    noiseFloor[NUM_BANDS] = {0};
bool     noiseFloorReady = false;
uint32_t detectStartMs = 0;
bool     inDetection = false;
float    peakBands[NUM_BANDS] = {0};
float    peakConf = 0;
char     peakCls[8] = "unknown";

// Deterrent state machine
bool     deterring = false;
uint32_t deterStartMs = 0;
uint32_t deterEndMs = 0;
uint32_t cooldownUntilMs = 0;
bool     activeUltrasonic = false, activeStrobe = false, activeBuzzer = false;

uint32_t lastHeartbeatMs = 0;
uint32_t bootMs = 0;

int16_t  samples[WINDOW_SAMPLES];

// LEDC channels
#define LEDC_ULTRASONIC 0
#define LEDC_BUZZER     1

// ---------------------------------------------------------------------------
// LEDC compatibility
// ---------------------------------------------------------------------------
/*
 * ESP32 Arduino core 3.x reworked the LEDC API: ledcWrite() and
 * ledcChangeFrequency() now take the GPIO, where 2.x took the channel number.
 * Calling the wrong one compiles on some cores and silently drives nothing on
 * others, which is a miserable thing to debug with a transducer in your hand.
 * These two helpers take both and route to whichever the installed core wants,
 * so the sketch builds and behaves identically on either.
 */
static inline void pwmWrite(uint8_t pin, uint8_t ch, uint32_t duty) {
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
  (void)ch; ledcWrite(pin, duty);
#else
  (void)pin; ledcWrite(ch, duty);
#endif
}

static inline void pwmFreq(uint8_t pin, uint8_t ch, uint32_t freq) {
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
  (void)ch; ledcChangeFrequency(pin, freq, 8);
#else
  (void)pin; ledcChangeFrequency(ch, freq, 8);
#endif
}

// ---------------------------------------------------------------------------
// Forward declarations
// ---------------------------------------------------------------------------
// The Arduino IDE normally generates these itself, but it gets it wrong for
// functions taking a struct reference or a default argument — both of which
// appear below. Declaring them explicitly removes that failure mode.
String eventJson(const Event& e, const char* note = nullptr);
String statusJson();
String configJson();
void   pushEvent(const char* evt, const char* cls, float conf, const float* bands,
                 uint16_t dwell, bool cu, bool cs, bool cb, uint16_t durMs,
                 const char* note);
void   startDeterrent(uint16_t durationMs);
void   stopDeterrent();
bool   jsonInt(const String& body, const char* key, long& out);

// ===========================================================================
// Config persistence
// ===========================================================================
void loadConfig() {
  prefs.begin("pestguard", true);
  cfg.sens            = prefs.getUChar("sens", 62);
  String pat          = prefs.getString("pattern", "sweep");
  strncpy(cfg.pattern, pat.c_str(), sizeof(cfg.pattern) - 1);
  cfg.pattern[sizeof(cfg.pattern) - 1] = 0;
  cfg.intensity       = prefs.getUChar("intensity", 78);
  cfg.dur             = prefs.getUChar("dur", 12);
  cfg.cooldown        = prefs.getUShort("cooldown", 45);
  cfg.ultrasonic      = prefs.getBool("ultrasonic", true);
  cfg.strobe          = prefs.getBool("strobe", true);
  cfg.buzzer          = prefs.getBool("buzzer", true);
  cfg.quiet           = prefs.getBool("quiet", false);
  cfg.quietStart      = prefs.getUShort("quietStart", 22 * 60);
  cfg.quietEnd        = prefs.getUShort("quietEnd", 6 * 60);
  cfg.quietUltrasonic = prefs.getBool("quietUS", true);
  cfg.heartbeat       = prefs.getUShort("heartbeat", 300);
  armed               = prefs.getBool("armed", true);
  prefs.end();
}

void saveConfig() {
  prefs.begin("pestguard", false);
  prefs.putUChar("sens", cfg.sens);
  prefs.putString("pattern", cfg.pattern);
  prefs.putUChar("intensity", cfg.intensity);
  prefs.putUChar("dur", cfg.dur);
  prefs.putUShort("cooldown", cfg.cooldown);
  prefs.putBool("ultrasonic", cfg.ultrasonic);
  prefs.putBool("strobe", cfg.strobe);
  prefs.putBool("buzzer", cfg.buzzer);
  prefs.putBool("quiet", cfg.quiet);
  prefs.putUShort("quietStart", cfg.quietStart);
  prefs.putUShort("quietEnd", cfg.quietEnd);
  prefs.putBool("quietUS", cfg.quietUltrasonic);
  prefs.putUShort("heartbeat", cfg.heartbeat);
  prefs.putBool("armed", armed);
  prefs.end();
}

