Paullistowel/pestguard/firmware/pestguard_esp32/pestguard_esp32.ino
// ===========================================================================
// Device identity
// ===========================================================================
String deviceId() {
  uint64_t mac = ESP.getEfuseMac();
  char buf[24];
  snprintf(buf, sizeof(buf), "PG-%02X%02X%02X",
           (uint8_t)(mac >> 24), (uint8_t)(mac >> 16), (uint8_t)(mac >> 8));
  return String(buf);
}

// ===========================================================================
// Battery
// ===========================================================================
float readBatteryVolts() {
  // Average a few reads — the ESP32 ADC is noisy enough that a single sample
  // makes the app's discharge regression fit garbage.
  uint32_t acc = 0;
  for (int i = 0; i < 16; i++) acc += analogRead(PIN_BATTERY);
  float raw = acc / 16.0f;
  return (raw / 4095.0f) * ADC_REF_V * BATTERY_DIVIDER;
}

uint8_t batteryPercent(float v) {
  float pct = (v - BATTERY_EMPTY_V) / (BATTERY_FULL_V - BATTERY_EMPTY_V) * 100.0f;
  if (pct < 0) pct = 0;
  if (pct > 100) pct = 100;
  return (uint8_t)(pct + 0.5f);
}

// ===========================================================================
// Sampling + Goertzel
// ===========================================================================

/** Fill `samples` at approximately SAMPLE_RATE_HZ using busy-wait timing. */
void captureWindow() {
  const uint32_t periodUs = 1000000UL / SAMPLE_RATE_HZ;
  uint32_t next = micros();
  for (int i = 0; i < WINDOW_SAMPLES; i++) {
    while ((int32_t)(micros() - next) < 0) { /* spin */ }
    next += periodUs;
    samples[i] = (int16_t)adc1_get_raw(ADC1_CHANNEL_0) - 2048;  // centre on 0
  }
}

/**
 * Goertzel magnitude for one target frequency over the captured window.
 * Cheaper than an FFT when you only care about a handful of bins, which is
 * exactly the case here — twelve probes instead of a 512-point transform.
 */
float goertzel(float freqHz) {
  float k = 0.5f + ((WINDOW_SAMPLES * freqHz) / SAMPLE_RATE_HZ);
  float omega = (2.0f * PI * (int)k) / WINDOW_SAMPLES;
  float coeff = 2.0f * cosf(omega);
  float s0 = 0, s1 = 0, s2 = 0;
  for (int i = 0; i < WINDOW_SAMPLES; i++) {
    s0 = samples[i] + coeff * s1 - s2;
    s2 = s1;
    s1 = s0;
  }
  float mag = sqrtf(s1 * s1 + s2 * s2 - coeff * s1 * s2);
  return mag / (WINDOW_SAMPLES / 2.0f);
}

/*
 * Envelope features — the SENSOR_ENVELOPE path.
 *
 * Four numbers, in the same slots the spectral mode uses so the wire format
 * and every downstream chart stay identical:
 *   f0 loudness   peak level above the tracked noise floor
 *   f1 attack     how abruptly it started; a gnaw is sharp, wind is gradual
 *   f2 rhythm     zero-crossing rate of the envelope about its own mean,
 *                 which is what separates repetitive gnawing from a steady tone
 *   f3 sustain    fraction of the window spent above the floor
 */
void computeEnvelopeFeatures(float* out) {
  int32_t sum = 0;
  int16_t peak = 0;
  for (int i = 0; i < WINDOW_SAMPLES; i++) {
    int16_t v = samples[i] < 0 ? -samples[i] : samples[i];
    sum += v;
    if (v > peak) peak = v;
  }
  float mean = (float)sum / WINDOW_SAMPLES;

  // Crossings of the window mean: a proxy for how rhythmic the envelope is.
  uint16_t crossings = 0;
  uint16_t above = 0;
  bool prevAbove = false;
  for (int i = 0; i < WINDOW_SAMPLES; i++) {
    int16_t v = samples[i] < 0 ? -samples[i] : samples[i];
    bool isAbove = v > mean;
    if (i && isAbove != prevAbove) crossings++;
    if (isAbove) above++;
    prevAbove = isAbove;
  }

  // Attack: how much steeper the fastest rise is than the average level.
  int16_t maxRise = 0;
  for (int i = 1; i < WINDOW_SAMPLES; i++) {
    int16_t d = samples[i] - samples[i - 1];
    if (d > maxRise) maxRise = d;
  }

  const float FULL = 2048.0f;
  out[0] = constrain(peak / FULL, 0.0f, 1.0f);
  out[1] = constrain(maxRise / (FULL * 0.35f), 0.0f, 1.0f);
  out[2] = constrain(crossings / (float)(WINDOW_SAMPLES * 0.35f), 0.0f, 1.0f);
  out[3] = constrain(above / (float)WINDOW_SAMPLES, 0.0f, 1.0f);
}

/** Band energies: sum of PROBES_PER_BAND Goertzel probes spread across each band. */
void computeBands(float* out) {
  for (int b = 0; b < NUM_BANDS; b++) {
    float lo = BAND_EDGES[b][0], hi = BAND_EDGES[b][1];
    float sum = 0;
    for (int p = 0; p < PROBES_PER_BAND; p++) {
      float f = lo + (hi - lo) * (p + 0.5f) / PROBES_PER_BAND;
      sum += goertzel(f);
    }
    out[b] = sum / PROBES_PER_BAND;
  }
}

// ===========================================================================
// On-device classification
// ===========================================================================
/*
 * Deliberately simple and inspectable: ratios between bands, not a model. The
 * app runs a proper classifier over the same four numbers and shows a refined
 * label — but this one has to run in a few microseconds, needs no training
 * data, and is what actually gates the deterrent. Keeping it readable means a
 * wrong call can be diagnosed on a bench with a scope rather than debugged
 * through a black box.
 */
void classify(const float* norm, char* clsOut, float* confOut) {
#if SENSOR_ENVELOPE
  /*
   * Envelope classification.
   *
   * With no spectrum available these are behavioural categories, not species
   * identifications, and the confidence ceiling is deliberately lower than the
   * spectral path's. Calling a sharp rhythmic burst "rodent" on envelope data
   * alone would be a guess dressed up as a measurement — the app shows these
   * with the sensor mode attached so the distinction stays visible.
   */
  float loud = norm[0], attack = norm[1], rhythm = norm[2], sustain = norm[3];

  // Gnawing / scratching: sharp onset, strongly rhythmic, not sustained.
  float gnaw    = attack * 1.5f + rhythm * 1.4f - sustain * 0.8f;
  // Chirping: loud, sharp, short bursts with moderate rhythm.
  float chirp   = loud * 1.3f + attack * 0.9f - rhythm * 0.5f - sustain * 0.6f;
  // Steady stridulation or machinery: sustained and smooth.
  float steady  = sustain * 1.7f - attack * 0.9f;

  const char* cls = "unknown";
  float best = 0.0f;
  if (gnaw   > best) { best = gnaw;   cls = "rodent"; }
  if (chirp  > best) { best = chirp;  cls = "bird"; }
  if (steady > best) { best = steady; cls = "insect"; }

