Paullistowel/pestguard/firmware/pestguard_esp32/pestguard_esp32.ino
  // Cap at 0.8: envelope evidence never justifies more than that.
  float conf = constrain(best * 0.55f, 0.0f, 0.80f);
  if (conf < 0.35f) { cls = "unknown"; conf = 0.30f + conf * 0.2f; }

  strncpy(clsOut, cls, 7);
  clsOut[7] = 0;
  *confOut = conf;
  return;
#else
  float b1 = norm[0], b2 = norm[1], b3 = norm[2], b4 = norm[3];
  float best = 0;
  const char* cls = "unknown";

  // Bird: energy concentrated low, little above 9 kHz.
  float bird = b1 * 1.6f - b3 * 0.8f - b4 * 0.8f;
  // Insect: strong mid/high harmonic structure.
  float insect = (b3 + b4) * 1.3f - b1 * 0.6f;
  // Rodent: broad, with a distinct b2 emphasis from squeaks over gnawing.
  float rodent = b2 * 1.7f + b1 * 0.5f - b4 * 0.5f;

  if (bird > best)   { best = bird;   cls = "bird"; }
  if (insect > best) { best = insect; cls = "insect"; }
  if (rodent > best) { best = rodent; cls = "rodent"; }

  // Map the winning score into a confidence, floored so a marginal win never
  // reports as certainty.
  float conf = best;
  if (conf < 0) conf = 0;
  if (conf > 1) conf = 1;

  if (conf < 0.35f) { cls = "unknown"; conf = 0.30f + conf * 0.3f; }

  strncpy(clsOut, cls, 7);
  clsOut[7] = 0;
  *confOut = conf;
#endif
}

// ===========================================================================
// Event emission
// ===========================================================================
uint64_t epochMs() {
  time_t now = time(nullptr);
  if (now < 1600000000) return 0;          // NTP never landed
  return (uint64_t)now * 1000ULL;
}

void pushEvent(const char* evt, const char* cls, float conf, const float* bands,
               uint16_t dwell, bool cu, bool cs, bool cb, uint16_t durMs,
               const char* note) {
  Event& e = ring[ringHead];
  e.id = ++eventSeq;
  e.ts = epochMs();
  e.up = millis();
  strncpy(e.evt, evt, sizeof(e.evt) - 1); e.evt[sizeof(e.evt) - 1] = 0;
  strncpy(e.cls, cls, sizeof(e.cls) - 1); e.cls[sizeof(e.cls) - 1] = 0;
  e.conf = conf;
  for (int i = 0; i < NUM_BANDS; i++) e.b[i] = bands ? bands[i] : 0;
  e.dwell = dwell;
  float v = readBatteryVolts();
  e.volts = v;
  e.batt = batteryPercent(v);
  e.rssi = WiFi.RSSI();
  e.chUltrasonic = cu; e.chStrobe = cs; e.chBuzzer = cb;
  e.durMs = durMs;

  ringHead = (ringHead + 1) % EVENT_BUFFER_SIZE;
  if (ringCount < EVENT_BUFFER_SIZE) ringCount++;

  String json = "{\"t\":\"event\",\"e\":" + eventJson(e, note) + "}";
  ws.broadcastTXT(json);
}

String eventJson(const Event& e, const char* note) {
  String s = "{";
  s += "\"id\":" + String(e.id);
  s += ",\"ts\":" + String((unsigned long)(e.ts / 1000ULL)) + "000";
  s += ",\"up\":" + String(e.up);
  s += ",\"evt\":\"" + String(e.evt) + "\"";
  s += ",\"cls\":\"" + String(e.cls) + "\"";
  s += ",\"conf\":" + String(e.conf, 3);
  s += ",\"b\":[";
  for (int i = 0; i < NUM_BANDS; i++) {
    if (i) s += ",";
    s += String(e.b[i], 3);
  }
  s += "]";
  s += ",\"dwell\":" + String(e.dwell);
  s += ",\"batt\":" + String(e.batt);
  s += ",\"volts\":" + String(e.volts, 3);
  s += ",\"rssi\":" + String(e.rssi);
  if (e.chUltrasonic || e.chStrobe || e.chBuzzer) {
    s += ",\"ch\":[";
    bool first = true;
    if (e.chUltrasonic) { s += "\"ultrasonic\""; first = false; }
    if (e.chStrobe)     { if (!first) s += ","; s += "\"strobe\""; first = false; }
    if (e.chBuzzer)     { if (!first) s += ","; s += "\"buzzer\""; }
    s += "]";
    s += ",\"dur\":" + String(e.durMs);
  }
  if (note && note[0]) s += ",\"note\":\"" + String(note) + "\"";
  s += "}";
  return s;
}

// ===========================================================================
// Deterrent
// ===========================================================================
bool inQuietHours() {
  if (!cfg.quiet) return false;
  time_t now = time(nullptr);
  if (now < 1600000000) return false;      // no clock, cannot honour a schedule
  struct tm t;
  localtime_r(&now, &t);
  uint16_t m = t.tm_hour * 60 + t.tm_min;
  return cfg.quietStart <= cfg.quietEnd
       ? (m >= cfg.quietStart && m < cfg.quietEnd)
       : (m >= cfg.quietStart || m < cfg.quietEnd);
}

void startDeterrent(uint16_t durationMs) {
  bool quiet = inQuietHours();
  activeUltrasonic = cfg.ultrasonic;
  activeStrobe     = cfg.strobe && !(quiet && cfg.quietUltrasonic);
  activeBuzzer     = cfg.buzzer && !(quiet && cfg.quietUltrasonic);

  if (activeUltrasonic) {
    pwmWrite(PIN_ULTRASONIC, LEDC_ULTRASONIC, map(cfg.intensity, 0, 100, 0, 255));
  }
  if (activeStrobe) digitalWrite(PIN_STROBE, HIGH);
  if (activeBuzzer) pwmWrite(PIN_BUZZER, LEDC_BUZZER, 128);

  deterring    = true;
  deterStartMs = millis();
  deterEndMs   = deterStartMs + durationMs;
}

void stopDeterrent() {
  pwmWrite(PIN_ULTRASONIC, LEDC_ULTRASONIC, 0);
  pwmWrite(PIN_BUZZER, LEDC_BUZZER, 0);
  digitalWrite(PIN_STROBE, LOW);
  deterring = false;
  activeUltrasonic = activeStrobe = activeBuzzer = false;
  cooldownUntilMs = millis() + (uint32_t)cfg.cooldown * 1000UL;
}

/** Pattern shaping, applied while a burst is running. */
void serviceDeterrent() {
  if (!deterring) return;
  uint32_t now = millis();
  if (now >= deterEndMs) { stopDeterrent(); return; }

  uint32_t elapsed = now - deterStartMs;

  if (strcmp(cfg.pattern, "sweep") == 0 && activeUltrasonic) {
    // Sweep the carrier 18–40 kHz over 2 s so pests cannot habituate.
    uint32_t freq = 18000 + (elapsed % 2000) * 11;
    pwmFreq(PIN_ULTRASONIC, LEDC_ULTRASONIC, freq);
  } else if (strcmp(cfg.pattern, "pulse") == 0) {
    bool on = (elapsed % 500) < 200;
    if (activeUltrasonic) pwmWrite(PIN_ULTRASONIC, LEDC_ULTRASONIC, on ? map(cfg.intensity, 0, 100, 0, 255) : 0);
    if (activeStrobe) digitalWrite(PIN_STROBE, on ? HIGH : LOW);
  } else if (strcmp(cfg.pattern, "burst") == 0) {
    bool on = elapsed < 800 || (elapsed % 1500) < 300;
    if (activeStrobe) digitalWrite(PIN_STROBE, on ? HIGH : LOW);
    if (activeBuzzer) pwmWrite(PIN_BUZZER, LEDC_BUZZER, on ? 200 : 0);
  } else if (strcmp(cfg.pattern, "random") == 0 && activeUltrasonic) {
    if (elapsed % 400 < 20) {
      pwmFreq(PIN_ULTRASONIC, LEDC_ULTRASONIC, 18000 + random(22000));
      pwmWrite(PIN_ULTRASONIC, LEDC_ULTRASONIC, map(random(50, cfg.intensity + 1), 0, 100, 0, 255));
    }
  }
}

