Paullistowel/pestguard/firmware/pestguard_esp32/pestguard_esp32.ino
// ===========================================================================
// Detection loop
// ===========================================================================
void runDetector() {
  captureWindow();

  float raw[NUM_BANDS];
#if SENSOR_ENVELOPE
  computeEnvelopeFeatures(raw);
#else
  computeBands(raw);
#endif

  // Track the noise floor while nothing is happening. Slow EWMA — the floor
  // should follow the wind and the generator, not the pest.
  if (!noiseFloorReady) {
    static uint16_t warmup = 0;
    for (int i = 0; i < NUM_BANDS; i++) noiseFloor[i] += raw[i];
    if (++warmup >= 60) {
      for (int i = 0; i < NUM_BANDS; i++) noiseFloor[i] /= warmup;
      noiseFloorReady = true;
    }
    return;
  }

  float total = 0, floorTotal = 0;
  for (int i = 0; i < NUM_BANDS; i++) { total += raw[i]; floorTotal += noiseFloor[i]; }
  if (floorTotal < 1e-6f) floorTotal = 1e-6f;

  // Sensitivity 0..100 maps to a multiple of the noise floor. Higher setting
  // means a louder signature is required, matching the app's slider labels.
  float trigger = 1.5f + (cfg.sens / 100.0f) * 6.0f;
  bool over = (total / floorTotal) > trigger;

  if (over) {
    // Normalise the bands for classification and for the app's charts.
    float norm[NUM_BANDS];
    float peak = 0;
    for (int i = 0; i < NUM_BANDS; i++) if (raw[i] > peak) peak = raw[i];
    if (peak < 1e-6f) peak = 1e-6f;
    for (int i = 0; i < NUM_BANDS; i++) norm[i] = raw[i] / peak;

    char cls[8]; float conf;
    classify(norm, cls, &conf);

    if (!inDetection) {
      inDetection = true;
      detectStartMs = millis();
      peakConf = 0;
    }
    if (conf >= peakConf) {
      peakConf = conf;
      strncpy(peakCls, cls, sizeof(peakCls) - 1);
      for (int i = 0; i < NUM_BANDS; i++) peakBands[i] = norm[i];
    }
  } else {
    // Only adapt the floor when quiet, so a sustained pest cannot train the
    // detector into ignoring it.
    for (int i = 0; i < NUM_BANDS; i++) noiseFloor[i] = noiseFloor[i] * 0.995f + raw[i] * 0.005f;

    if (inDetection) {
      inDetection = false;
      uint32_t dwellMs32 = millis() - detectStartMs;
      uint16_t dwell = dwellMs32 > 65535 ? 65535 : (uint16_t)dwellMs32;
      if (dwell < 40) return;              // too brief to be anything real

      bool fire = armed
                && strcmp(cfg.pattern, "silent") != 0
                && strcmp(peakCls, "unknown") != 0
                && peakConf > 0.45f
                && millis() > cooldownUntilMs;

      if (fire) {
        startDeterrent((uint16_t)cfg.dur * 1000);
        pushEvent("deter", peakCls, peakConf, peakBands, dwell,
                  activeUltrasonic, activeStrobe, activeBuzzer,
                  (uint16_t)cfg.dur * 1000, nullptr);
      } else {
        pushEvent("detect", peakCls, peakConf, peakBands, dwell,
                  false, false, false, 0, nullptr);
      }
    }
  }
}

// ===========================================================================
// JSON output
// ===========================================================================
String configJson() {
  String s = "{";
  s += "\"sens\":" + String(cfg.sens);
  s += ",\"pattern\":\"" + String(cfg.pattern) + "\"";
  s += ",\"intensity\":" + String(cfg.intensity);
  s += ",\"dur\":" + String(cfg.dur);
  s += ",\"cooldown\":" + String(cfg.cooldown);
  s += ",\"ultrasonic\":" + String(cfg.ultrasonic ? "true" : "false");
  s += ",\"strobe\":" + String(cfg.strobe ? "true" : "false");
  s += ",\"buzzer\":" + String(cfg.buzzer ? "true" : "false");
  s += ",\"quiet\":" + String(cfg.quiet ? "true" : "false");
  s += ",\"quietStart\":" + String(cfg.quietStart);
  s += ",\"quietEnd\":" + String(cfg.quietEnd);
  s += ",\"quietUltrasonic\":" + String(cfg.quietUltrasonic ? "true" : "false");
  s += ",\"heartbeat\":" + String(cfg.heartbeat);
  s += "}";
  return s;
}

String statusJson() {
  float v = readBatteryVolts();
  String s = "{";
  s += "\"proto\":1";
  s += ",\"id\":\"" + deviceId() + "\"";
  s += ",\"name\":\"" + String(NODE_NAME) + "\"";
  s += ",\"zone\":\"" + String(NODE_ZONE) + "\"";
  s += ",\"fw\":\"pestguard-esp32 1.0.0\"";
  s += ",\"up\":" + String(millis());
  s += ",\"time\":" + String((unsigned long)(epochMs() / 1000ULL)) + "000";
  s += ",\"status\":\"";
  s += faulted ? "fault" : (deterring ? "deterring" : (armed ? "armed" : "disarmed"));
  s += "\"";
  s += ",\"rssi\":" + String(WiFi.RSSI());
  s += ",\"ssid\":\"" + WiFi.SSID() + "\"";
  s += ",\"ip\":\"" + WiFi.localIP().toString() + "\"";
  s += ",\"batt\":" + String(batteryPercent(v));
  s += ",\"volts\":" + String(v, 3);
  s += ",\"events\":" + String(eventSeq);
  s += ",\"buffered\":" + String(ringCount);
  s += ",\"sampleRate\":" + String(SAMPLE_RATE_HZ);
#if SENSOR_ENVELOPE
  // Tell the app what the four numbers actually are, so it never labels an
  // envelope feature as a frequency band it did not measure.
  s += ",\"sensor\":\"envelope\"";
  s += ",\"featureLabels\":[\"Loudness\",\"Attack\",\"Rhythm\",\"Sustain\"]";
  s += ",\"bands\":[]";
#else
  s += ",\"sensor\":\"waveform\"";
  s += ",\"featureLabels\":[]";
  s += ",\"bands\":[";
  for (int i = 0; i < NUM_BANDS; i++) {
    if (i) s += ",";
    s += "[" + String((int)BAND_EDGES[i][0]) + "," + String((int)BAND_EDGES[i][1]) + "]";
  }
  s += "]";
#endif
  s += ",\"config\":" + configJson();
  s += "}";
  return s;
}

// ===========================================================================
// Minimal JSON field extraction
// ===========================================================================
/*
 * The config body is a flat object of numbers, booleans and one short string,
 * so a full JSON parser would be 20 KB of flash to read thirteen fields. These
 * two helpers do it directly. They are not a general parser and are not used on
 * anything but our own config payload.
 */
bool jsonInt(const String& body, const char* key, long& out) {
  String needle = "\"" + String(key) + "\":";
  int i = body.indexOf(needle);
  if (i < 0) return false;
  i += needle.length();
  while (i < (int)body.length() && (body[i] == ' ')) i++;
  int start = i;
  if (i < (int)body.length() && (body[i] == '-' || body[i] == '+')) i++;
  while (i < (int)body.length() && isDigit(body[i])) i++;
  if (i == start) return false;
  out = body.substring(start, i).toInt();
  return true;
}

bool jsonBool(const String& body, const char* key, bool& out) {
  String needle = "\"" + String(key) + "\":";
  int i = body.indexOf(needle);
  if (i < 0) return false;
  i += needle.length();
  while (i < (int)body.length() && body[i] == ' ') i++;
  if (body.startsWith("true", i))  { out = true;  return true; }
  if (body.startsWith("false", i)) { out = false; return true; }
  return false;
}

