Paullistowel/pestguard/firmware/pestguard_esp32/pestguard_esp32.ino
bool jsonStr(const String& body, const char* key, char* out, size_t cap) {
  String needle = "\"" + String(key) + "\":\"";
  int i = body.indexOf(needle);
  if (i < 0) return false;
  i += needle.length();
  int end = body.indexOf('"', i);
  if (end < 0) return false;
  String v = body.substring(i, end);
  strncpy(out, v.c_str(), cap - 1);
  out[cap - 1] = 0;
  return true;
}

// ===========================================================================
// HTTP handlers
// ===========================================================================
void sendJson(int code, const String& body) {
  http.sendHeader("Access-Control-Allow-Origin", "*");
  http.sendHeader("Access-Control-Allow-Headers", "Content-Type");
  http.sendHeader("Access-Control-Allow-Methods", "GET,POST,OPTIONS");
  http.send(code, "application/json", body);
}

void handleStatus() { sendJson(200, statusJson()); }

void handleEvents() {
  // Replay the ring buffer, oldest first, optionally only past a sequence id.
  uint32_t since = http.hasArg("since") ? (uint32_t)http.arg("since").toInt() : 0;
  int limit = http.hasArg("limit") ? http.arg("limit").toInt() : EVENT_BUFFER_SIZE;
  if (limit <= 0 || limit > EVENT_BUFFER_SIZE) limit = EVENT_BUFFER_SIZE;

  String s = "{\"events\":[";
  int emitted = 0;
  for (uint16_t n = 0; n < ringCount; n++) {
    uint16_t idx = (ringHead + EVENT_BUFFER_SIZE - ringCount + n) % EVENT_BUFFER_SIZE;
    if (ring[idx].id <= since) continue;
    if (emitted >= limit) break;
    if (emitted) s += ",";
    s += eventJson(ring[idx]);
    emitted++;
  }
  s += "],\"count\":" + String(emitted) + ",\"seq\":" + String(eventSeq) + "}";
  sendJson(200, s);
}

void handleGetConfig() { sendJson(200, configJson()); }

void handlePostConfig() {
  String body = http.arg("plain");
  long v; bool b; char str[8];

  if (jsonInt(body, "sens", v))       cfg.sens = constrain(v, 0, 100);
  if (jsonInt(body, "intensity", v))  cfg.intensity = constrain(v, 0, 100);
  if (jsonInt(body, "dur", v))        cfg.dur = constrain(v, 1, 120);
  if (jsonInt(body, "cooldown", v))   cfg.cooldown = constrain(v, 0, 3600);
  if (jsonInt(body, "quietStart", v)) cfg.quietStart = constrain(v, 0, 1439);
  if (jsonInt(body, "quietEnd", v))   cfg.quietEnd = constrain(v, 0, 1439);
  if (jsonInt(body, "heartbeat", v))  cfg.heartbeat = constrain(v, 10, 3600);
  if (jsonBool(body, "ultrasonic", b)) cfg.ultrasonic = b;
  if (jsonBool(body, "strobe", b))     cfg.strobe = b;
  if (jsonBool(body, "buzzer", b))     cfg.buzzer = b;
  if (jsonBool(body, "quiet", b))      cfg.quiet = b;
  if (jsonBool(body, "quietUltrasonic", b)) cfg.quietUltrasonic = b;
  if (jsonStr(body, "pattern", str, sizeof(str))) {
    strncpy(cfg.pattern, str, sizeof(cfg.pattern) - 1);
    cfg.pattern[sizeof(cfg.pattern) - 1] = 0;
  }

  saveConfig();
  pushEvent("config_ack", "unknown", 0, nullptr, 0, false, false, false, 0, nullptr);
  sendJson(200, "{\"ok\":true,\"config\":" + configJson() + "}");
}

void handleCmd() {
  String body = http.arg("plain");
  char cmd[24] = "";
  jsonStr(body, "cmd", cmd, sizeof(cmd));

  if (strcmp(cmd, "arm") == 0) {
    armed = true; saveConfig();
  } else if (strcmp(cmd, "disarm") == 0) {
    armed = false;
    if (deterring) stopDeterrent();
    saveConfig();
  } else if (strcmp(cmd, "test-deterrent") == 0) {
    startDeterrent(4000);
    pushEvent("deter", "unknown", 1.0f, nullptr, 0,
              activeUltrasonic, activeStrobe, activeBuzzer, 4000, "Manual test burst");
  } else if (strcmp(cmd, "identify") == 0) {
    for (int i = 0; i < 6; i++) {
      digitalWrite(PIN_STATUS_LED, HIGH); delay(80);
      digitalWrite(PIN_STATUS_LED, LOW);  delay(80);
    }
  } else if (strcmp(cmd, "reboot") == 0) {
    sendJson(200, "{\"ok\":true}");
    delay(200);
    ESP.restart();
    return;
  } else {
    sendJson(400, "{\"ok\":false,\"msg\":\"unknown command\"}");
    return;
  }

  ws.broadcastTXT("{\"t\":\"status\",\"s\":" + statusJson() + "}");
  sendJson(200, "{\"ok\":true,\"cmd\":\"" + String(cmd) + "\"}");
}

void handleRoot() {
  // A human landing on the device in a browser should get something useful,
  // not a 404 that reads like the board is broken.
  String s = "<!doctype html><meta name=viewport content='width=device-width,initial-scale=1'>";
  s += "<style>body{font:15px system-ui;margin:2rem;max-width:34rem;color:#111}";
  s += "code{background:#f1f3f5;padding:.15rem .35rem;border-radius:4px}</style>";
  s += "<h2>PestGuard node " + deviceId() + "</h2>";
  s += "<p>Status: <b>" + String(armed ? "armed" : "disarmed") + "</b>";
  s += " &middot; battery " + String(batteryPercent(readBatteryVolts())) + "%";
  s += " &middot; " + String(eventSeq) + " events since boot</p>";
  s += "<p>This is the device API, not the app. Open the PestGuard app and add ";
  s += "this address: <code>" + WiFi.localIP().toString() + "</code></p>";
  s += "<p>Endpoints: <code>/api/status</code> <code>/api/events</code> ";
  s += "<code>/api/config</code> <code>/api/cmd</code> &middot; WebSocket on port ";
  s += String(WS_PORT) + "</p>";
  http.send(200, "text/html", s);
}

void onWsEvent(uint8_t num, WStype_t type, uint8_t* payload, size_t len) {
  if (type == WStype_CONNECTED) {
    ws.sendTXT(num, "{\"t\":\"status\",\"s\":" + statusJson() + "}");
  } else if (type == WStype_TEXT) {
    String msg = String((char*)payload).substring(0, len);
    long id;
    if (msg.indexOf("\"ping\"") >= 0) {
      if (!jsonInt(msg, "id", id)) id = 0;
      ws.sendTXT(num, "{\"t\":\"pong\",\"id\":" + String(id) + "}");
    }
  }
}

// ===========================================================================
// Setup / loop
// ===========================================================================
void setup() {
  Serial.begin(115200);
  delay(200);
  Serial.println("\nPestGuard ESP32 node starting");

  pinMode(PIN_STROBE, OUTPUT);      digitalWrite(PIN_STROBE, LOW);
  pinMode(PIN_STATUS_LED, OUTPUT);  digitalWrite(PIN_STATUS_LED, LOW);

  // ESP32 core 3.x changed the LEDC API. Both spellings are kept so this
  // sketch compiles on 2.x and 3.x without the user having to care.
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcAttachChannel(PIN_ULTRASONIC, 25000, 8, LEDC_ULTRASONIC);
  ledcAttachChannel(PIN_BUZZER,      2800, 8, LEDC_BUZZER);
#else
  ledcSetup(LEDC_ULTRASONIC, 25000, 8);
  ledcAttachPin(PIN_ULTRASONIC, LEDC_ULTRASONIC);
  ledcSetup(LEDC_BUZZER, 2800, 8);
  ledcAttachPin(PIN_BUZZER, LEDC_BUZZER);
#endif
  pwmWrite(PIN_ULTRASONIC, LEDC_ULTRASONIC, 0);
  pwmWrite(PIN_BUZZER, LEDC_BUZZER, 0);

  analogSetPinAttenuation(PIN_BATTERY, ADC_11db);
  adc1_config_width(ADC_WIDTH_BIT_12);
  adc1_config_channel_atten(ADC1_CHANNEL_0, ADC_ATTEN_DB_11);

  loadConfig();

  WiFi.mode(WIFI_STA);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
  Serial.print("Connecting to Wi-Fi");
  uint32_t t0 = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - t0 < 30000) {
    delay(400);
    Serial.print(".");
    digitalWrite(PIN_STATUS_LED, !digitalRead(PIN_STATUS_LED));
  }

  if (WiFi.status() == WL_CONNECTED) {
    digitalWrite(PIN_STATUS_LED, HIGH);
    Serial.println();
    Serial.print("Connected. Add this address in the PestGuard app: ");
    Serial.println(WiFi.localIP());
    if (MDNS.begin("pestguard")) {
      MDNS.addService("http", "tcp", 80);
      Serial.println("Also reachable at http://pestguard.local");
    }
    // Best effort only — the node runs fine without a clock, it just reports
    // ts=0 and lets the app derive wall-clock time from uptime.
    configTime(0, 0, "pool.ntp.org", "time.nist.gov");
  } else {
    Serial.println("\nWi-Fi failed. Detection still runs; the app cannot reach it.");
    faulted = true;
    strncpy(faultMsg, "Wi-Fi connection failed", sizeof(faultMsg) - 1);
  }

