Paullistowel/pestguard/firmware/pestguard_esp32/pestguard_esp32.ino
  http.on("/", handleRoot);
  http.on("/api/status", HTTP_GET, handleStatus);
  http.on("/api/events", HTTP_GET, handleEvents);
  http.on("/api/config", HTTP_GET, handleGetConfig);
  http.on("/api/config", HTTP_POST, handlePostConfig);
  http.on("/api/cmd",    HTTP_POST, handleCmd);
  http.onNotFound([]() {
    if (http.method() == HTTP_OPTIONS) { sendJson(204, ""); return; }
    sendJson(404, "{\"ok\":false,\"msg\":\"no such endpoint\"}");
  });
  http.begin();

  ws.begin();
  ws.onEvent(onWsEvent);

  bootMs = millis();
  lastHeartbeatMs = millis();
  pushEvent("online", "unknown", 0, nullptr, 0, false, false, false, 0, "Node booted");
  Serial.println("Ready. Listening.");
}

void loop() {
  http.handleClient();
  ws.loop();
  serviceDeterrent();

  // Detection is the priority; networking is serviced between windows. Each
  // window is ~13 ms, so the HTTP server still feels instant.
  if (!deterring || strcmp(cfg.pattern, "silent") == 0) {
    runDetector();
  }

  uint32_t now = millis();
  if (now - lastHeartbeatMs >= (uint32_t)cfg.heartbeat * 1000UL) {
    lastHeartbeatMs = now;
    pushEvent("heartbeat", "unknown", 0, nullptr, 0, false, false, false, 0, nullptr);
    ws.broadcastTXT("{\"t\":\"status\",\"s\":" + statusJson() + "}");
  }

  // Reconnect if the AP drops. Detection keeps running throughout — losing
  // Wi-Fi must never stop the node protecting the field.
  static uint32_t lastWifiCheck = 0;
  if (now - lastWifiCheck > 10000) {
    lastWifiCheck = now;
    if (WiFi.status() != WL_CONNECTED) {
      digitalWrite(PIN_STATUS_LED, LOW);
      WiFi.disconnect();
      WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
    } else {
      digitalWrite(PIN_STATUS_LED, HIGH);
    }
  }
}
